Dataset: HR dataset https://docs.google.com/spreadsheets/d/1PW-b9PF0j_x6yTwgLFWdv5-mjm2egnyYmfDftW9H0Pg/edit?usp=sharing 

Sheets:

	1. Employee
	2. Department
	3. Locations
	4. Job_history
	5. Jobs

## All Imports

In [19]:
import pandas as pd
import openpyxl

In [20]:
file_name = pd.ExcelFile('HR Dataset.xlsx')
file_name.sheet_names

['Employee', 'Department', 'Job_history', 'Locations', 'Jobs']

In [21]:
Employee_df= file_name.parse('Employee')
Department_df= file_name.parse('Department')
Job_history_df= file_name.parse('Job_history')
Locations_df= file_name.parse('Locations')
Jobs_df= file_name.parse('Jobs')
Employee_df.head()

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,NaN,103.0,60.0

### 1. Count the NaN values of all the columns of locations file

In [22]:
Locations_df.isnull().sum() 
#isnull() returns a boolean value for each cell in the dataframe.
# and sum() returns the sum of all the True values in each column.

location_id       0
street_address    0
postal_code       1
city              0
state_province    6
country_id        0
dtype: int64

### 2. Display the name, salary and department number for those employees whose first name ends with the letter 'm'

In [23]:
selected_df=Employee_df[['first_name','last_name','salary','department_id']]
#[[  ]] double brackets are used to select multiple columns  
# selected_df.head()
letter_m_df=selected_df[selected_df['first_name'].str.startswith('M')]

letter_m_df.head()

   first_name last_name  salary  department_id
20    Matthew     Weiss    8000           50.0
30      Mozhe  Atkinson    2800           50.0
34    Michael    Rogers    2900           50.0
64     Mattea   Marvins    7200           80.0
82     Martha  Sullivan    2500           50.0

### 3. display the first name, last name, salary and department number for those employees whose first name ends with the letter 'd' or 'n' or 's' and also arrange the result in descending order by department id.

In [24]:
selected_df=Employee_df[['first_name','last_name','salary','department_id']]
end_d_n_s_df= selected_df[selected_df['last_name'].str.endswith(('d','n','s'))]
end_d_n_s_df.sort_values(by='department_id',ascending=False).head()

      first_name last_name  salary  department_id
105      Shelley   Higgins   12000          110.0
10          John      Chen    8200          100.0
12   Jose Manuel     Urman    7800          100.0
2            Lex   De Haan   17000           90.0
53   Christopher     Olsen    8000           80.0

### 4. Find the employees who work either in department 70 or 90.

In [25]:
dep_70_90=Employee_df[(Employee_df['department_id'].isin([70,90]))]
dep_70_90.head()

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000,NaN,101.0,70.0

### 5. Display the first, last name, salary and department number for those employees who hold a letter n as a 3rd character in their first name.

In [26]:
selected_df=Employee_df[['first_name','last_name','salary','department_id']]
letter_n_df=selected_df[selected_df['first_name'].str[2]=='n']
letter_n_df.head()

   first_name  last_name  salary  department_id
8       Nancy  Greenberg   12000          100.0
9      Daniel     Faviet    9000          100.0
14        Den   Raphaely   11000           30.0
37     Renske     Ladwig    3600           50.0
43    Randall      Matos    2600           50.0

### 6. Display the first name, job id, salary and department for those employees not working in the departments 50,30 and 80

In [27]:
selected_df=Employee_df[['first_name','job_id','salary','department_id']]
not_50_30_80_df=selected_df[~selected_df['department_id'].isin([50,30,80])]
# ~ is used to negate the condition 
not_50_30_80_df

      first_name      job_id  salary  department_id
0         Steven     AD_PRES   24000           90.0
1          Neena       AD_VP   17000           90.0
2            Lex       AD_VP   17000           90.0
3      Alexander     IT_PROG    9000           60.0
4          Bruce     IT_PROG    6000           60.0
5          David     IT_PROG    4800           60.0
6          Valli     IT_PROG    4800           60.0
7          Diana     IT_PROG    4200           60.0
8          Nancy      FI_MGR   12000          100.0
9         Daniel  FI_ACCOUNT    9000          100.0
10          John  FI_ACCOUNT    8200          100.0
11        Ismael  FI_ACCOUNT    7700          100.0
12   Jose Manuel  FI_ACCOUNT    7800          100.0
13          Luis  FI_ACCOUNT    6900          100.0
78     Kimberely      SA_REP    7000            NaN
100     Jennifer     AD_ASST    4400           10.0
101      Michael      MK_MAN   13000           20.0
102          Pat      MK_REP    6000           20.0
103        Susan      HR_REP    6500           40.0
104      Hermann      PR_REP   10000           70.0
105      Shelley      AC_MGR   12000          110.0
106      William  AC_ACCOUNT    8300          110.0

### 7. Display the ID for those employees who did two or more jobs in the past.

In [28]:
two_more_series=Job_history_df['employee_id'].value_counts()>=2 # gives a series with employee_id as index and boolean value as value for >=2
two_more_series[two_more_series==True]

101    True
200    True
176    True
Name: employee_id, dtype: bool

OR

In [29]:
two_more_df =Job_history_df.groupby('employee_id').filter(lambda x: len(x) >= 2)
#here we are grouping the dataframe by employee_id and then filtering the dataframe based on the length of the group
two_more_df.employee_id.unique()

array([101, 200, 176], dtype=int64)

### 8. Calculate minimum, maximum and mean salary from employees file

In [30]:
min_max_mean_series=Employee_df['salary'].agg(['min','max','mean'])
min_max_mean_series

min      2100.000000
max     24000.000000
mean     6461.682243
Name: salary, dtype: float64

### 9. display the first and last name and date of joining of the employees who is either Sales Representative or Sales Man.

In [39]:

join_employee_jobs_df=pd.merge(Employee_df,Jobs_df,how='inner',on='job_id')

selected_df=join_employee_jobs_df[['first_name','last_name','hire_date','job_title']].query ('job_title in ["Sales Representative","Sales Man"]') 

selected_df

     first_name   last_name  hire_date             job_title
50        Peter      Tucker 2005-01-30  Sales Representative
51        David   Bernstein 2005-03-24  Sales Representative
52        Peter        Hall 2005-08-20  Sales Representative
53  Christopher       Olsen 2006-03-30  Sales Representative
54      Nanette   Cambrault 2006-12-09  Sales Representative
55       Oliver     Tuvault 2007-11-23  Sales Representative
56      Janette        King 2004-01-30  Sales Representative
57      Patrick       Sully 2004-03-04  Sales Representative
58        Allan      McEwen 2004-08-01  Sales Representative
59      Lindsey       Smith 2005-03-10  Sales Representative
60       Louise       Doran 2005-12-15  Sales Representative
61       Sarath      Sewall 2006-11-03  Sales Representative
62        Clara     Vishney 2005-11-11  Sales Representative
63     Danielle      Greene 2007-03-19  Sales Representative
64       Mattea     Marvins 2008-01-24  Sales Representative
65        David         Lee 2008-02-23  Sales Representative
66       Sundar        Ande 2008-03-24  Sales Representative
67         Amit       Banda 2008-04-21  Sales Representative
68         Lisa        Ozer 2005-03-11  Sales Representative
69     Harrison       Bloom 2006-03-23  Sales Representative
70       Tayler         Fox 2006-01-24  Sales Representative
71      William       Smith 2007-02-23  Sales Representative
72    Elizabeth       Bates 2007-03-24  Sales Representative
73      Sundita       Kumar 2008-04-21  Sales Representative
74        Ellen        Abel 2004-05-11  Sales Representative
75       Alyssa      Hutton 2005-03-19  Sales Representative
76     Jonathon      Taylor 2006-03-24  Sales Representative
77         Jack  Livingston 2006-04-23  Sales Representative
78    Kimberely       Grant 2007-05-24  Sales Representative
79      Charles     Johnson 2008-01-04  Sales Representative

### 10. display the first and last name, and department number for all employees whose last name is "McEwen".

In [51]:
selected_df=Employee_df[['first_name','last_name','department_id']].query("last_name=='McEwen'")
# selected_df=selected_df.query("last_name=='McEwen'")
selected_df.head()

   first_name last_name  department_id
58      Allan    McEwen           80.0

### 11. create and display a boolean series, where True for not null and False for null values or missing values in state_province column of locations file.

In [52]:
Locations_df.state_province.isnull()

0      True
1      True
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
Name: state_province, dtype: bool

### 12. Compute the average salary earned by each department with department name

In [57]:
join_employee_department=pd.merge (Employee_df,Department_df,how='inner',on='department_id')
join_employee_department.groupby('department_name')['salary'].mean()

department_name
Accounting          10150.000000
Administration       4400.000000
Executive           19333.333333
Finance              8600.000000
Human Resources      6500.000000
IT                   5760.000000
Marketing            9500.000000
Public Relations    10000.000000
Purchasing           4150.000000
Sales                8955.882353
Shipping             3475.555556
Name: salary, dtype: float64

### 13. Compute the number of departments located in Seattle city.

In [68]:
join_department_location=pd.merge(Department_df,Locations_df,how='inner',on='location_id').query("city=='Seattle'")

join_department_location.department_name.nunique()

21

### 14. What is the average salary of job ‘Finance Manager’

In [73]:
join_employee_jobs_df=pd.merge(Employee_df,Jobs_df,how='inner',on='job_id')

join_employee_jobs_df.query("job_title=='Finance Manager'")['salary'].mean()

12000.0

### 15. You are offered a position either as ‘Sales Representative’ or ‘Marketing Representative’. You want to join a position with a smaller number of employees. Which position will you join?

In [81]:
join_employee_jobs_df=pd.merge(Employee_df,Jobs_df,how='inner',on='job_id')

join_employee_jobs_df=join_employee_jobs_df.query("job_title in ['Sales Representative','Marketing Representative']")
join_employee_jobs_df.value_counts('job_title')

job_title
Sales Representative        30
Marketing Representative     1
dtype: int64